In [2]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [11]:
name = {1: 'saeed', 2: 'rakan', 3: 'mohammed'}
names = pd.Series(name)
names

1       saeed
2       rakan
3    mohammed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [14]:
names.index = ['11', '12', '13']
names

11       saeed
12       rakan
13    mohammed
dtype: object

## Q3: Retrieve First and second elements.

In [18]:
names[:2]

11    saeed
12    rakan
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [25]:
n1 = pd.Series({14: 'saeed', 15: 'rakan'})
n2 = names.append(n1)
n2

n2.drop_duplicates()

11       saeed
12       rakan
13    mohammed
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [27]:
 student = {'ID': ['11', '12', '13'],
        'NAME': ['saeed', 'amer', 'rakan'],
            'GPA': ['4,5', '3.88', '4.65'],}
students =pd.DataFrame (student)    
students

   ID   NAME   GPA
0  11  saeed   4,5
1  12   amer  3.88
2  13  rakan  4.65

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [33]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [41]:
edu.loc[:12, ['TIME', 'GEO']]

    TIME                            GEO
0   2000  European Union (28 countries)
1   2001  European Union (28 countries)
2   2002  European Union (28 countries)
3   2003  European Union (28 countries)
4   2004  European Union (28 countries)
5   2005  European Union (28 countries)
6   2006  European Union (28 countries)
7   2007  European Union (28 countries)
8   2008  European Union (28 countries)
9   2009  European Union (28 countries)
10  2010  European Union (28 countries)
11  2011  European Union (28 countries)
12  2000  European Union (27 countries)

In [40]:
edu[:12]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e